Repository: MarcoPNS/Networkteam.Neos.PasswordReset
Catalog: Resources/Private/Translations/*/Main.xlf
Languages: de

# mail.noAccountSubject
source: Lost password
de: Passwort vergessen

# mail.forgotPasswordSubject
source: Lost password
de: Passwort vergessen

# passwordManagement.passwordPatternTitle
source: Must contain at least one number and one uppercase and lowercase letter, and at least 12 or more characters
de: Muss mindestens eine Zahl und einen Groß- und Kleinbuchstaben sowie mindestens 12 oder mehr Zeichen enthalten

# passwordManagement.passwordPatternError.title
source: Password does not match pattern
de: Passwort stimmt nicht mit dem Muster überein

# passwordManagement.passwordPatternError.body
source: The given password does not match the demanded pattern. {0}
de: Das angegebene Passwort stimmt nicht mit dem geforderten Muster überein. {0}

# passwordManagement.change.success.title
source: Password changed
de: Passwort geändert

# passwordManagement.change.success.body
source: Your password has been changed successfully.
de: Ihr Passwort wurde erfolgreich geändert.

# passwordManagement.change.passwordNoMatch.title
source: Passwords do not match
de: Passwörter stimmen nicht überein

# passwordManagement.change.passwordNoMatch.body
source: The entered passwords do not match.
de: Die eingegebenen Passwörter stimmen nicht überein.

# passwordManagement.change.currentPasswordInvalid.title
source: Current password invalid
de: Bisheriges Passwort ungültig

# passwordManagement.change.currentPasswordInvalid.body
source: The given current password is invalid.
de: Das angegebene bisherige Passwort ist ungültig.

# passwordManagement.reset.tokenInvalid.title
source: Failed to set password
de: Passwort konnte nicht geändert werden

# passwordManagement.reset.tokenInvalid.body
source: Your password could not be reset due to an invalid token. Please use the password forget function to get a valid link.
de: Aufgrund eines ungültigen Tokens konnte ihr Passwort nicht zurückgesetzt werden. Nutzen sie die Passwort vergessen Funktion erneut, um sich einen gültigen Link zuschicken zu lassen.

# passwordManagement.reset.loginFailed.title
source: Login failed
de: Login fehlgeschlagen

# passwordManagement.reset.loginFailed.body
source: Failed to directly login account.
de: Ihr Passwort wurde erfolgreich gesetzt. Der direkte Login ist allerdings fehlgeschlagen.

# passwordManagement.reset.passwordNoMatch.title
source: Passwords do not match
de: Passwörter stimmen nicht überein

# passwordManagement.reset.passwordNoMatch.body
source: The entered passwords do not match.
de: Die eingegebenen Passwörter stimmen nicht überein.
